{"pages":[],"posts":[{"title":"Build Your Own Blog using Hexo","text":"Welcome to my world! This blog will walk you through steps to build your own blog using Hexo. I assume that you already have a GitHub account and git installed on your PC. Create Your GitHub RepositoryYour blog will be available at https://username.github.io, supported by GitHub. See GitHub Pages for detail. First, we need to create a new repository on GitHub name username.github.io, where username is your GitHub user name. Clone the repository by running the following command:1$ git clone https://github.com/&lt;username&gt;/&lt;username&gt;.github.io.git The repository directory will be used as your blog root directory. Install Hexo Install Node.js on your computer. Download Install Hexo via npm:1$ npm install -g hexo-cli You might want to use an mirror website to accelerate npm install process. Add the registry param for temporary usage. 1$ npm install -g hexo-cli --registry https://registry.npm.taobao.org Local Test Create an empty directory, for temporary use. Enter the directory and let Hexo generate initial files. 12$ cd &lt;dir_name&gt;$ hexo init Copy the files under to your repository directory. Then run the following commands under your repository directory: 123$ npm install # install necessary plugins for Hexo$ hexo g # generate static pages$ hexo s # start server, open localhost:4000 with your browser Now you can see your blog using default Hexo theme ‘landscape’. Deploy on GitHub modify _config.yml under your blog root directory:1234deploy: type: git repo: https://github.com/&lt;username&gt;/&lt;project&gt; branch: master Note: You can also use SSH for repo address, which requires SSH key match. Your blog will be deployed on branch ‘master’ as default. If you want to store your source code (e.g. modification to themes, markdown files) in the same repository, you’d better create another branch for such purpose. After deployment, the remote ‘master’ branch will have different files, which will cause conflict. install hexo-deployer-git plugin via npm run hexo d to deploy your blog on GitHub. Check it out for yourself: https://username.github.io Change Hexo Blog ThemeI’m using Hexo theme Icarus now. See Icarus. More themes here. I’m using Hexo version 5.0.0, and currently not all themes support this brand new version. Starting from version 5.0.0, Hexo allows installing themes from npm. However, the theme I choose need some modification to adapt to Hexo 5.0.0, so I choose to do it the old fashion way. The modifications to be made are listed here: #github issue. Download &amp; extract or git clone Icarus from GitHub to your blog’s theme folder: 1$ git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus Carry out the above modifications (#github issue) plus this one: 1theme: icarus Now you can check it locally (hexo s) or online (hexo d).","link":"/2020/08/05/Build-Your-Own-Blog-using-Hexo/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/08/05/hello-world/"},{"title":"Build Your Own Blog using Hexo (CN)","text":"GitHub+Hexo搭建个人博客 本文主要介绍使用GitHub+Hexo搭建个人博客的一些关键步骤以及关于内容创作的一些想法。 GitHub+Hexo GitHub聚集了世界上最大的开发者社区。开发者在这里发现、分享、开发更好的软件。无论是开源项目还是私有仓库，GitHub为合作开发提供了一个all-in-one平台。 Hexo是一个快速、简洁且高效的博客框架。它支持Markdown、支持插件、一键部署等特性以及活跃的Hexo社区使它成为搭建静态博客的不错选择。 接下来介绍搭建博客的主要步骤 1. 创建GitHub RepositoryGitHub+Hexo搭建的博客可以使用GitHub提供的免费URL： https://username.github.io，详见GitHub Pages。你也可以配置使用自己的URL，但可能会增加购买域名开销。 首先，我们需要创建一个名为username.github.io的GitHub仓库，username 是你的GitHub用户名。将该仓库克隆到本地： 1$ git clone https://github.com/&lt;username&gt;/&lt;username&gt;.github.io.git 仓库所在的本地目录将作为博客本地根目录。 2. 安装HexoHexo使用Node.js渲染，首先安装Node.js。Node.js下载 使用npm安装Hexo： 1$ npm install -g hexo-cli 如果不能科学上网，可以考虑在使用npm安装时，使用镜像源。这里给出一种临时使用镜像的方法： 1$ npm install -g hexo-cli --registry https://registry.npm.taobao.org 3. 本地测试Hexo创建博客的初始文件时，需要在空路径下。因此，新建一个文件夹用于临时容纳初始文件： 12$ cd &lt;dir_name&gt;$ hexo init 将新建文件夹下的文件复制到之前的GitHub仓库路径下。进行如下操作： 123$ npm install # install necessary plugins for Hexo$ hexo g # generate static pages$ hexo s # start server, open localhost:4000 with your browser 现在你可以打开浏览器在localhost:4000看到使用默认的Hexo主题landscape的博客了。 4. 部署到GitHub修改博客根目录下的_config.yml文件： 1234deploy: type: git repo: https://github.com/&lt;username&gt;/&lt;project&gt; branch: master 这里可以将repo对应地址改为SSH的。branch设置了部署的分支是master分支。由于GitHub在部署分支远端只保存静态网页文件，我另建了一个分支用于markdown和前端源码备份。 接下来使用npm安装hexo-deployer-git插件。执行hexo d完成部署。打开https://username.github.io，即可查看。 5. 更换Hexo主题Hexo在/themes路径下管理不同的主题。_config.yml在中修改theme: &lt;theme_name&gt;进行切换。我选择了支持插件种类较多的 Icarus主题。选择其他主题：Hexo主题。 从Hexo version 5.0.0开始，Hexo支持通过npm安装主题。但目前(Aug 2020)，并非所有Hexo主题都更新了对5.0.0版本以及npm渠道的支持。 传统的安装Hexo主题的方法为，从GitHub下载/clone主题仓库到/themes文件夹。使用过程中遇到问题可参考GitHub Issue。例如ICARUS主题对Hexo 5.0.0不适配的问题，作者在github issue给出了解决方案。 每个Hexo主题都有对应的前端、插件代码，可以自行开发新功能后发起Pull Request. 6. 博客写作与发布Hexo的博客markdown文档保存在/source路径下。在markdown文件开头加入如下代码段，提供博客的标题、时间、类别、标签等信息： 12345678910---title: Build Your Own Blog using Hexodate: 2020-08-05 23:56:07categories:- Blogtags:- Hexo- Icarus- Set up--- 如果hexo d之后，远端网页没更新，可尝试重新执行hexo g生成静态网页文件之后再hexo d 关于内容创作的一些想法1. one-size-fits-all对于up主、博主，内容创作与分享的工作应当专注于内容本身而不是为了适应不同的平台不同的格式要求而频繁修改甚至重写作品。markdown具有相对简洁的语法和主流博客平台的支持，因此成为技术类博客写作的合适选择。 GitHub+Hexo相比于支持在线编辑的博客平台，在博客写作方面并没有明显区别，如果不玩前端就不会带来过多的学习成本。作为备用的博客平台，还是值得推荐的。 2. pros &amp; cons 优势：DIY前端，为GitHub引流，本地远端备份 劣势：搜索引擎引流不足，在线更新不便 3. 博客定位写markdown博客还是挺费精力的，需要谋篇布局、遣词造句、绘图上传。我平时习惯于用oneNote写笔记，乱糟糟的，偶尔有空挑一些可公开的内容写成md文档，作为笔记博客还是ok的。至于吸引关注什么的，暂时没什么想法。 Hexo博客先老老实实当我的笔记本吧(TAT)","link":"/2020/08/16/Build-Your-Own-Blog-using-Hexo-CN/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Icarus","slug":"Icarus","link":"/tags/Icarus/"},{"name":"Set up","slug":"Set-up","link":"/tags/Set-up/"},{"name":"CN","slug":"CN","link":"/tags/CN/"}],"categories":[{"name":"Blog","slug":"Blog","link":"/categories/Blog/"}]}