{"pages":[],"posts":[{"title":"Build Your Own Blog using Hexo","text":"Welcome to my world! This blog will walk you through steps to build your own blog using Hexo. I assume that you already have a GitHub account and git installed on your PC. Create Your GitHub RepositoryYour blog will be available at https://username.github.io, supported by GitHub. See GitHub Pages for detail. First, we need to create a new repository on GitHub name .github.io, where is your GitHub user name. Clone the repository by running the following command:1$ git clone https://github.com/&lt;username&gt;/&lt;username&gt;.github.io.git The repository directory will be used as your blog root directory. Install Hexo Install Node.js on your computer. Download Install Hexo via npm:1$ npm install -g hexo-cli You might want to use an mirror website to accelerate npm install process. Add the registry param for temporary usage. 1$ npm install -g hexo-cli --registry https://registry.npm.taobao.org Local Test Create an empty directory, for temporary use. Enter the directory and let Hexo generate initial files. 12$ cd &lt;dir_name&gt;$ hexo init Copy the files under to your repository directory. Then run the following commands under your repository directory: 123$ npm install # install necessary plugins for Hexo$ hexo g # generate static pages$ hexo s # start server, open localhost:4000 with your browser Now you can see your blog using default Hexo theme ‘landscape’. Deploy on GitHub modify _config.yml under your blog root directory:1234deploy: type: git repo: https://github.com/&lt;username&gt;/&lt;project&gt; branch: master Note: You can also use SSH for repo address, which requires SSH key match. Your blog will be deployed on branch ‘master’ as default. If you want to store your source code (e.g. modification to themes, markdown files) in the same repository, you’d better create another branch for such purpose. After deployment, the remote ‘master’ branch will have different files, which will cause conflict. install hexo-deployer-git plugin via npm: run hexo d to deploy your blog on GitHub. Check it out for yourself: https://.github.io Change Hexo Blog ThemeI’m using Hexo theme Icarus now. See Icarus. More themes here. I’m using Hexo version 5.0.0, and currently not all themes support this brand new version. Starting from version 5.0.0, Hexo allows installing themes from npm. However, the theme I choose need some modification to adapt to Hexo 5.0.0, so I choose to do it the old fashion way. The modifications to be made are listed here: #github issue. Download &amp; extract or git clone Icarus from GitHub to your blog’s theme folder: 1$ git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus Carry out the above modifications (#github issue) plus this one: 1theme: icarus Now you can check it locally (hexo s) or online (hexo d).","link":"/2020/08/05/Build-Your-Own-Blog-using-Hexo/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/08/05/hello-world/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Icarus","slug":"Icarus","link":"/tags/Icarus/"},{"name":"Set up","slug":"Set-up","link":"/tags/Set-up/"}],"categories":[{"name":"Blog","slug":"Blog","link":"/categories/Blog/"}]}